Catalogs/СчетаДоверительногоУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>СчетаДоверительногоУправления</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Comment>Числовая часть кода счета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСчетаДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСчетовДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговораДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаключения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРасторжения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛичныйКабинет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпециализированныйДепозитарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КалендарьКотировок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АгентскийДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиКонсолидированныйБухгалтерскийУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговораПоУправлениюПенсионнымиНакоплениямиИРезервами</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровПоУправлениюПенсионнымиНакоплениямиИРезервами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеЦелевогоКапитала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеИспользованияЦелевогоКапитала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасчетныеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РасчетныйСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/УсловияДоговоровДоверительногоУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УсловияДоговоровДоверительногоУправления</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НеобходимыеРасходы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПроцентнаяСтавка</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтоматическаяПролонгация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантСрокаПролонгации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыСрокаПролонгации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПролонгации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипИнвестиционногоНалоговогоВычета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИнвестиционныхНалоговыхВычетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентЧувствительности</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплатаВознагражденияУправляющегоИУслугСпецдепозитарияИзСобственныхСредствКлиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРаскрытияИнформации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРаскрытияИнформацииОКонфликтеИнтересов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеЦелевогоКапитала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаправлениеИспользованияЦелевогоКапитала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Создал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВариантыСрокаПролонгации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВариантыСрокаПролонгации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДоКонцаСледующегоГода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоЛетСрокаПролонгации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоДнейСрокаПролонгации</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыДоговоровДоверительногоУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровДоверительногоУправления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйИнвестиционныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрольСаморегулируемыхОрганизаций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрольСтраховыхКомпаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собственный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиАкционерныхИнвестиционныхФондов</Name>
					<Comment>Управление активами АИФ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиЖилищногоОбеспеченияВоеннослужащих</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиПаевогоИнвестиционногоФонда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиПФР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиСаморегулируемыхОрганизаций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиФизическогоЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиФОГФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиЮридическогоЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеИмуществомСтраховыхКомпаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеПенсионнымиНакоплениями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеПенсионнымиРезервами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеРезервамиСтраховыхКомпаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеСобственнымиСредствамиПенсионныхФондов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиЦелевыхКапиталов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Лицензии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Лицензии</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганВыдавшийЛицензию</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРешения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СчетаДоверительногоУправления/Forms/УсловияДоговоровДоверительногоУправления/Ext/Form/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, СписокРеквизитов());
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, "Организация,ВидДоговораДоверительногоУправления,НоваяЗапись");
	
	Если Параметры.Свойство("Ссылка") Тогда
		КонтрольНеобходимыхРасходовВЦеломПоКлиентуИВидуДоговора = РегистрыСведений.УсловияДоговоровДоверительногоУправления.НеобходимыеРасходыКонтролируютсяПоКлиентуИВидуДоговора(Организация, Параметры.Ссылка, Период);
	КонецЕсли; 
	
	ЭтаФорма.Лицензии.ЗагрузитьЗначения(Параметры.МассивЛицензий);
	ЭтаФорма.ПериодыДругихЗаписей.ЗагрузитьЗначения(Параметры.ПериодыДругихЗаписей);
	
	УстановитьСвязиПараметровВыбораЛицензии();
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ИноеНаправлениеИспользованияЦелевогоКапиталаПриИзменении(Элемент)
	
	ЭтаФорма.Элементы.НаправлениеИспользованияЦелевогоКапитала.РедактированиеТекста = (ИноеНаправлениеИспользованияЦелевогоКапитала = 1);
	ЭтаФорма.Элементы.НаправлениеИспользованияЦелевогоКапитала.РежимВыбораИзСписка = Не ЭтаФорма.Элементы.НаправлениеИспользованияЦелевогоКапитала.РедактированиеТекста;
	
КонецПроцедуры
#КонецОбласти

#Область СобытияРеквизитов

&НаКлиенте
Процедура АвтоматическаяПролонгацияПриИзменении(Элемент)
	
	Если НЕ ЭтаФорма.АвтоматическаяПролонгация Тогда
		ЭтаФорма.ВариантСрокаПролонгации	= Неопределено;
		ЭтаФорма.СрокПролонгации			= Неопределено;
	КонецЕсли;
				
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантСрокаПролонгацииПриИзменении(Элемент)
	
	Если ЭтаФорма.ВариантСрокаПролонгации = ПредопределенноеЗначение("Перечисление.ВариантыСрокаПролонгации.ДоКонцаСледующегоГода") Тогда
		ЭтаФорма.СрокПролонгации = Неопределено;
	ИначеЕсли ЭтаФорма.ВариантСрокаПролонгации = ПредопределенноеЗначение("Перечисление.ВариантыСрокаПролонгации.КоличествоДнейСрокаПролонгации") Тогда
		ЭтаФорма.ЕдиницаСрокаПролонгации = "день";	
	ИначеЕсли ЭтаФорма.ВариантСрокаПролонгации = ПредопределенноеЗначение("Перечисление.ВариантыСрокаПролонгации.КоличествоЛетСрокаПролонгации") Тогда
		ЭтаФорма.ЕдиницаСрокаПролонгации = "год";	
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры
	
&НаКлиенте
Процедура ЛицензииОбработкаВыбора(Элемент, МассивЗначений, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	Если ТипЗнч(МассивЗначений) = Тип("Массив") Тогда
		Для Каждого ВыбранноеЗначение Из МассивЗначений Цикл
			ДобавитьВыбранноеЗначениеВСписок(ЭтаФорма.Лицензии, ВыбранноеЗначение);
		КонецЦикла;
	Иначе		
		ДобавитьВыбранноеЗначениеВСписок(ЭтаФорма.Лицензии, МассивЗначений);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицензииЗначениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЭтаФорма.Лицензии.НайтиПоЗначению(ВыбранноеЗначение) <> Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Значение уже выбрано в списке");
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти

#Область Команды

&НаКлиенте
Процедура КомандаСохранить(Команда)
	
	Отказ = Ложь;
	
	КонтрольЛицензий(Отказ);
	КонтрольПериода(Отказ);
	КонтрольНаправленияИспользованияЦК(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если НоваяЗапись Тогда
		ЭтаФорма.Создал			= РаботаСПользователями.ТекущийПользователь();
		ЭтаФорма.ДатаСоздания	= ТекущаяДата();
	Иначе
		ЭтаФорма.Изменил		= РаботаСПользователями.ТекущийПользователь();
		ЭтаФорма.ДатаИзменения	= ТекущаяДата();
	КонецЕсли;
	
	ПараметрыЗакрытия = Новый Структура(СписокРеквизитов());
	ЗаполнитьЗначенияСвойств(ПараметрыЗакрытия, ЭтаФорма);
	
	ПараметрыЗакрытия.Вставить("МассивЛицензий", ЭтаФорма.Лицензии.ВыгрузитьЗначения());
	
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

#КонецОбласти

#Область ДополнительныеПроцедурыИФункции

&НаКлиенте
Процедура КонтрольЛицензий(Отказ)
	
	МассивЭлементовДляУдаления = Новый Массив;
	
	Для Каждого ЭлементСписка Из ЭтаФорма.Лицензии Цикл
		Если НЕ ЗначениеЗаполнено(ЭлементСписка.Значение) Тогда
			МассивЭлементовДляУдаления.Добавить(ЭлементСписка);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ЭлементСписка Из МассивЭлементовДляУдаления Цикл
		ЭтаФорма.Лицензии.Удалить(ЭлементСписка);
	КонецЦикла;
	
	Если ЭтаФорма.Лицензии.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбрано ни одной лицензии",, "Лицензии",, Отказ);
		Возврат;
	КонецЕсли;
	
	КонтрольЛицензийНаСервере(ЭтаФорма.Период, ЭтаФорма.Организация, ЭтаФорма.Лицензии.ВыгрузитьЗначения(), Отказ);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура КонтрольЛицензийНаСервере(Период, Организация, МассивЛицензий, Отказ)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период"			, Период);
	Запрос.УстановитьПараметр("Организация"		, Организация);
	Запрос.УстановитьПараметр("МассивЛицензий"	, МассивЛицензий);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Лицензии.Ссылка КАК Лицензия,
		|	Лицензии.ЮрФизЛицо = Организации.ЮрФизЛицо КАК ПринадлежитОрганизации,
		|	(Лицензии.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|		ИЛИ Лицензии.ДатаОкончания >= &Период)
		|		И ЕСТЬNULL(СтатусыЛицензийСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументов.Действует), ЛОЖЬ) КАК Актуальна
		|ИЗ
		|	Справочник.Лицензии КАК Лицензии
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО (Организации.Ссылка = &Организация)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЛицензий.СрезПоследних(&Период, ) КАК СтатусыЛицензийСрезПоследних
		|		ПО Лицензии.Ссылка = СтатусыЛицензийСрезПоследних.Лицензия
		|ГДЕ
		|	Лицензии.Ссылка В(&МассивЛицензий)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ Выборка.ПринадлежитОрганизации Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Лицензия '" + Выборка.Лицензия + "' не принадлежит организации " + Организация,,,, Отказ);
		ИначеЕсли НЕ Выборка.Актуальна Тогда	
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Лицензия '" + Выборка.Лицензия + "' не актуальна",,,, Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольПериода(Отказ)
	
	Если ЭтаФорма.ПериодыДругихЗаписей.НайтиПоЗначению(ЭтаФорма.Период) <> Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("На " + Формат(ЭтаФорма.Период, "ДФ=dd.MM.yyyy") + " условия договоров доверительного управления уже заданы",,,, Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольНаправленияИспользованияЦК(Отказ)
	
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.НаправлениеИспользованияЦелевогоКапитала) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено направление использования целевого капитала",,,, Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвязиПараметровВыбораЛицензии()
	
	ЭтаФорма.ЮрФизЛицоЛицензии	= ЭтаФорма.Организация.ЮрФизЛицо;
	
	МассивСвязей = Новый Массив();
	
	НовыйОтбор = Новый СвязьПараметраВыбора("Отбор.ЮрФизЛицо", "ЮрФизЛицоЛицензии", РежимИзмененияСвязанногоЗначения.Очищать);	
	МассивСвязей.Добавить(НовыйОтбор);

	ФиксМассив = Новый ФиксированныйМассив(МассивСвязей);		
	Элементы.ЛицензииЗначение.СвязиПараметровВыбора = ФиксМассив;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СписокРеквизитов()
	
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить("Период");
	МассивРеквизитов.Добавить("ЕдиницаСрокаПролонгации");
	
	Для Каждого Ресурс Из Метаданные.РегистрыСведений.УсловияДоговоровДоверительногоУправления.Ресурсы Цикл
		МассивРеквизитов.Добавить(Ресурс.Имя);
	КонецЦикла;
	
	Для Каждого Реквизит Из Метаданные.РегистрыСведений.УсловияДоговоровДоверительногоУправления.Реквизиты Цикл
		МассивРеквизитов.Добавить(Реквизит.Имя);
	КонецЦикла;
	
	Возврат СтрСоединить(МассивРеквизитов, ",");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(Форма)
	
	Элементы = Форма.Элементы;
	
	Элементы.ГруппаСрокПролонгации.Видимость	= Форма.АвтоматическаяПролонгация;
	Элементы.СрокПролонгации.Видимость			= (Форма.ВариантСрокаПролонгации = ПредопределенноеЗначение("Перечисление.ВариантыСрокаПролонгации.КоличествоЛетСрокаПролонгации")
													ИЛИ Форма.ВариантСрокаПролонгации = ПредопределенноеЗначение("Перечисление.ВариантыСрокаПролонгации.КоличествоДнейСрокаПролонгации"));
	
	Элементы.ТипИнвестиционногоНалоговогоВычета.Видимость			= (Форма.ВидДоговораДоверительногоУправления = ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет"));
	Элементы.НадписьУровеньКонтроляНеобходимыхРасходов.Видимость 	= Форма.КонтрольНеобходимыхРасходовВЦеломПоКлиентуИВидуДоговора;
	
	Элементы.ОплатаВознагражденияУправляющегоИУслугСпецдепозитарияИзСобственныхСредствКлиента.Видимость = 
				ЭтоВидДоговораСВозможностьюОплатыВознагражденияУправляющегоИзСобственныхСредствКлиента(Форма.ВидДоговораДоверительногоУправления);
				
	Если Элементы.НаправлениеИспользованияЦелевогоКапитала.СписокВыбора.НайтиПоЗначению(Форма.НаправлениеИспользованияЦелевогоКапитала) = Неопределено Тогда 
		Форма.ИноеНаправлениеИспользованияЦелевогоКапитала = 1;
	Иначе
		Форма.ИноеНаправлениеИспользованияЦелевогоКапитала = 0;
	КонецЕсли;	
	Элементы.НаправлениеИспользованияЦелевогоКапитала.РедактированиеТекста = (Форма.ИноеНаправлениеИспользованияЦелевогоКапитала = 1);
	Элементы.НаправлениеИспользованияЦелевогоКапитала.РежимВыбораИзСписка = Не Элементы.НаправлениеИспользованияЦелевогоКапитала.РедактированиеТекста;
											
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоВидДоговораСВозможностьюОплатыВознагражденияУправляющегоИзСобственныхСредствКлиента(ВидДоговораДоверительногоУправления)
	
	Возврат РегистрыСведений.УсловияДоговоровДоверительногоУправления.ДляВидаДоговораДУВозможнаОплатаВознагражденияУправляющегоИРасходовСпецдепозитарияИзСобственныхСредствКлиента(ВидДоговораДоверительногоУправления);
	
КонецФункции
	
&НаКлиенте
Процедура ДобавитьВыбранноеЗначениеВСписок(Список, ВыбранноеЗначение)
	
	Если Список.НайтиПоЗначению(ВыбранноеЗначение) = Неопределено Тогда
		Список.Добавить(ВыбранноеЗначение);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Значение уже выбрано в списке");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
